# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ 
# แล้วแสดงผลทางหน้าจอ ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ 
# จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

print('---------------------------------')
print('  คำนวณผลคูณของตัวเลข 2 จำนวน ')
print('---------------------------------')

while True:
    num1 = int(input("ใส่ตัวเลขที่ 1 : "))
    num2 = int(input("ใส่ตัวเลขที่ 2 : "))
    product = num1 * num2
    print(f"Product: {product}")
    if product > 5000:
        print(" ผลคูณมากกว่า 5000 โปรแกรมหยุดทำงาน ")
        break
    print('--------------------')
print('---------------------------')