# โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 ปีขึ้นไป 
# ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime

print('---------------------')
print('      เช็คปีเกิดของคุณ   ')
print('---------------------')

name_you = input("บอกชื่อ: ")
yearbon_you = int(input('บอกปีเกิด (พ.ศ.): '))
print('---------------------')
age_you = (datetime.now().year + 543)-yearbon_you

if age_you >= 35 :
    print(f'คุณ {name_you} อายุ {age_you} เห้ยแม่งแก่')
else :
    print(f'คุณ {name_you} อายุ {age_you} ไอนี้แม่งเด็กน้อย')
print('---------------------')