#โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
# หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
# หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
# หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
# หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
# หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
# หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('----------------------------')
print('    ตรวจสอบข้อมูลสายรถเมล์  ')
print('----------------------------')

name = input('บอกชื่อของคุณ: ')
Bus_line = int(input('บอกสายรถเมล์ที่จะไป 57, 3, 71, 56 หรือ 593: '))
print('----------------------------')
if Bus_line == 57 :
    print(f'คุณ {name} ไปปิ่นเกล้า บางขุนนนท์')
elif Bus_line == 3 :
    print(f'คุณ {name} ไปสนามหลวง ลาดพร้าว')
elif Bus_line == 71 :
    print(f'คุณ {name} ไปหัวลำโพง เยาวราช')
elif Bus_line == 56 :
    print(f'คุณ {name} ไปบางลำพูน สะพานกรุงธน')
elif Bus_line == 593 :
    print(f'คุณ {name} ไปอนุสวรีย์ชัย สามเสน')
else :
    print('คุณไม่ได้กรอกสายรถเมล์ตามที่เราสอบบถามไป')
print('----------------------------')
