# โปรแกรมทายตัวเลข โดยมีการทำงานของโปรแกรมดังนี้
# - ให้ผู้ใช้ทายตัวเลขโดยการป้อนตัวเลขทางแป้นพิมพ์
# - โดยกรณีที่ตัวเลขที่ป้อนมีค่าเท่ากับ 59 ให้แสดงข้อความ “ยินดีด้วยคุณทายถูก”
# - แต่หากตัวเลขที่ป้อนมีค่ามากหรือน้อยกว่า 59 ให้แสดงข้อความ “คุณทายผิดตัวเลขที่ป้อนมากไป” หรือ “คุณทายผิดตัวเลขที่ป้อนน้อยไป” และให้ผู้ใช้ป้อนใหม่
# - โดยโปรแกรมจะวนให้ผู้ใช้ป้อนไปเรื่อยๆ จนกว่าจะทายถูก
# ****************************************
# **** ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ****
# ****************************************
# ป้อนตัวเลขที่ต้องการทาย : 25
# คุณทายผิดตัวเลขที่ป้อนน้อยไป
# *****************************************
# ป้อนตัวเลขที่ต้องการทาย : 85
# คุณทายผิดตัวเลขที่ป้อนมากไป
# *****************************************
# ป้อนตัวเลขที่ต้องการทาย : 80
# คุณทายผิดตัวเลขที่ป้อนมากไป
# *****************************************
# ป้อนตัวเลขที่ต้องการทาย : 59
# ยินดีด้วยคุณทายถูก
# *****************************************

print("--------------------------------")
print(" ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ")
print("--------------------------------")

# กำหนดตัวเลขคำตอบ
secret_number = 59

while True:
    guess = int(input("ใส่ตัวเลขที่ต้องการทาย : "))

    if guess == secret_number:
        print("ยินดีด้วยคุณทายถูก")
        print("----------------")
        break
    elif guess > secret_number:
        print("คุณทายผิดตัวเลขที่ป้อนมากไป")
        print("----------------")
    else:
        print("คุณทายผิดตัวเลขที่ป้อนน้อยไป")
        print("----------------")
