#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ 
# และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้ ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
# ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
# ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
# ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย
print('----------------------------')
print('      คำนวณค่าคอมมิชชั่น  ')
print('----------------------------')

ID = input('รหัสของคุณ: ')
name = input('ชื่อของคุณ: ')
money = int(input('จำนวนเงิน: '))
print('----------------------------')
if money < 1000 :
    print(f'คุณ {name} รหัส {ID} ค่าคอมที่คุณได้คือ 0 บาท')
elif money > 1001 :
    com = money * 1/100
    print(f'คุณ {name} รหัส {ID} ค่าคอมที่คุณได้คือ {com} บาท')
elif money > 2001 :
    com = money * 3/100
    print(f'คุณ {name} รหัส {ID} ค่าคอมที่คุณได้คือ {com} บาท')
elif money > 3001 :
    com = money * 5/100
    print(f'คุณ {name} รหัส {ID} ค่าคอมที่คุณได้คือ {com} บาท')
else :
    print('คุณอดค่าคอมที่ควรจะได้')
print('----------------------------')
