# control Flow แบ่งเป็น 2 กลุ่ม / control statment แบ่งเป็น 2 กลุ่ม
# 1. selection / Fecision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3 แบบย่อย
#   -พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (If)
#   -พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จก็ทำ  (If-else)
#   -พิสูจน์ตรวจสอบหลายครั้ง               (If-elif-else)

# 2. Loop / Iteration/Repetition ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ แยกเป็น 2 แบบ
#   -รู้จำนวณครั้งในการทำซ้ำ
#   -ไม่รู้จำนวณครั้งในการทำซ้ำ
#   -while, for
#   ****สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้องรู็จบ****

#   ***Statement ทีั่เกี่ยวกับ Control Flow คือคำสั่ง Break, continue โดยเแพาะ loop
