# โปรแกรมตรวจสอบรถว่าผ่านเกณฑ์ของการตรวจสอบค่าคาร์บอนไดซ์ออกไซน์หรือ
# โดยหากค่าคาร์บอนไดซ์ออกไซน์มีค่าเกินกว่า 678.55 ให้แสดงข้อความว่า “ไม่ผ่าน”
# หากน้อยกว่า 678.55 ให้แสดงข้อความ “ผ่าน” โดยให้รับชื่อเจ้าของ ทะเบียนรถ 
# และปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ที่วัดได้ ทางแป้นพิมพ์
 
print('----------------------------')
print('       ตรวจสอบสภาพรถ        ')
print('----------------------------')
Car_owner = input('บอกชื่อมา: ')
Car_num = input('บอกทะเปียนรถมา: ')
Car_Carbon = float(input('บอกปริมาณคาร์บอนไดซ์อออกไซน์: '))
print('----------------------------')
if Car_Carbon > 678.55 :
    print(f'รถทะเบียน {Car_num} ของคุณ {Car_owner} ไม่ผ่านเกณฑ์')
    print('รถทะเบียน {} ของคุณ {} ไม่ผ่านเกณฑ์'.format(Car_num,Car_owner))
else :
    print(f'รถทะเบียน {Car_num} ของคุณ {Car_owner} ผ่านเกณฑ์')
    print('รถทะเบียน {} ของคุณ {} ผ่านเกณฑ์'.format(Car_num,Car_owner))
print('----------------------------')
print('ลาก่อน')