#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 
# ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? 
# น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

print('----------------------------')
print('         วัดน้ำหนักรถ  ')
print('----------------------------')

car_num = input('บอกเลขรถ: ')
car_weight = int(input('บอกน้ำหนักรถ: '))
print('----------------------------')

if car_weight > 1000 :
    print(f'เลขรถ {car_num} น้ำหนักไม่ผ่านเกณฑ์')
else :
    print(F'รถเลข {car_num} น้ำหนักผ่านเกณฑ์')
print('----------------------------')
