#Assignment Operator กำหนดค่า หรือ เครื่องหมาย =
# การทำงานของ = คือ เอาทางขวาไปใส่ทางซ้าย
#ยกเว้นว่า สิ่งที่อยู่ทางขวามีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลที่ได้ไปใส่ทางซ้าย
#ตัวแปร (variable) = ข้อมูล (data) /นิพจน์ (Expression)
#*** ตัวแปร (variable) คือ ชื่อที่ Dev. ตั้งขึ้นมาเองเอาไว้เก็บข้อมูล ***
# การใช้งานตัวแปร คือ เอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มันเก็บอยู่มาใช้ ***

score = 20
fullname = "นายปลา"
salary = input('บอกเงินเดือน')
sun = 20 +30
print('-------------------')
num = 10
#ตัวดำเนินการกำหนดค่าอย่างย่อ
num += 10 #num = num + 10
num -= 10 #num = num - 10
num *= 10 #num = num * 10
num /= 10 #num = num / 10
num %= 10 #num = num % 10
num //= 10 #num = num // 10
print(num)
print('-------------------')
